
# State **`s3://infrahouse-website-infra/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |       30 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                               |
|:--------:|:----------------------------------------------------------------------------------------|
|    🟢    | `module.website-staging.aws_acm_certificate.website`                                    |
|    🟢    | `module.website-staging.aws_acm_certificate_validation.website`                         |
|    🟢    | `module.website-staging.aws_alb.website`                                                |
|    🟢    | `module.website-staging.aws_alb_listener.redirect_to_ssl`                               |
|    🟢    | `module.website-staging.aws_alb_listener_rule.website`                                  |
|    🟢    | `module.website-staging.aws_alb_target_group.website`                                   |
|    🟢    | `module.website-staging.aws_autoscaling_group.website`                                  |
|    🟢    | `module.website-staging.aws_autoscaling_policy.cpu_load`                                |
|    🟢    | `module.website-staging.aws_launch_template.website`                                    |
|    🟢    | `module.website-staging.aws_lb_listener.ssl`                                            |
|    🟢    | `module.website-staging.aws_route53_record.cert_validation["staging.infrahouse.com"]`   |
|    🟢    | `module.website-staging.aws_route53_record.extra[0]`                                    |
|    🟢    | `module.website-staging.aws_s3_bucket.access_log[0]`                                    |
|    🟢    | `module.website-staging.aws_s3_bucket_policy.access_logs[0]`                            |
|    🟢    | `module.website-staging.aws_s3_bucket_public_access_block.public_access[0]`             |
|    🟢    | `module.website-staging.aws_security_group.alb`                                         |
|    🟢    | `module.website-staging.aws_security_group.backend`                                     |
|    🟢    | `module.website-staging.aws_vpc_security_group_egress_rule.alb_outgoing`                |
|    🟢    | `module.website-staging.aws_vpc_security_group_egress_rule.backend_outgoing`            |
|    🟢    | `module.website-staging.aws_vpc_security_group_ingress_rule.alb_icmp`                   |
|    🟢    | `module.website-staging.aws_vpc_security_group_ingress_rule.alb_listener_port`          |
|    🟢    | `module.website-staging.aws_vpc_security_group_ingress_rule.backend_icmp`               |
|    🟢    | `module.website-staging.aws_vpc_security_group_ingress_rule.backend_ssh_local`          |
|    🟢    | `module.website-staging.aws_vpc_security_group_ingress_rule.backend_user_traffic`       |
|    🟢    | `module.website-staging.aws_vpc_security_group_ingress_rule.https`                      |
|    🟢    | `module.website-staging.random_string.profile_suffix`                                   |
|    🟢    | `module.website-staging.module.instance_profile.aws_iam_instance_profile.profile`       |
|    🟢    | `module.website-staging.module.instance_profile.aws_iam_policy.profile`                 |
|    🟢    | `module.website-staging.module.instance_profile.aws_iam_role.profile`                   |
|    🟢    | `module.website-staging.module.instance_profile.aws_iam_role_policy_attachment.profile` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.website-staging.data.aws_iam_policy_document.access_logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "access_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::027434742980:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.website-staging.aws_acm_certificate.website will be created
  + resource "aws_acm_certificate" "website" {
      + arn                       = (known after apply)
      + domain_name               = "staging.infrahouse.com"
      + domain_validation_options = [
          + {
              + domain_name           = "staging.infrahouse.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "staging.infrahouse.com",
        ]
      + tags                      = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all                  = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # module.website-staging.aws_acm_certificate_validation.website will be created
  + resource "aws_acm_certificate_validation" "website" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.website-staging.aws_alb.website will be created
  + resource "aws_alb" "website" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = (known after apply)
      + name_prefix                                                  = "web"
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-04b8845d896c6ebde",
          + "subnet-0df885dcc99418799",
        ]
      + tags                                                         = (known after apply)
      + tags_all                                                     = (known after apply)
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + access_logs {
          + bucket  = (known after apply)
          + enabled = true
        }

      + subnet_mapping (known after apply)
    }

  # module.website-staging.aws_alb_listener.redirect_to_ssl will be created
  + resource "aws_alb_listener" "redirect_to_ssl" {
      + arn                      = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 80
      + protocol                 = (known after apply)
      + ssl_policy               = (known after apply)
      + tags_all                 = {
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.website-staging.aws_alb_listener_rule.website will be created
  + resource "aws_alb_listener_rule" "website" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 99
      + tags         = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all     = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "staging.infrahouse.com",
                ]
            }
        }
    }

  # module.website-staging.aws_alb_target_group.website will be created
  + resource "aws_alb_target_group" "website" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all                           = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-08e19d859c26d18b2"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 5
          + matcher             = "200-299"
          + path                = "/index.html"
          + port                = "80"
          + protocol            = "HTTP"
          + timeout             = 4
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.website-staging.aws_autoscaling_group.website will be created
  + resource "aws_autoscaling_group" "website" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 600
      + health_check_type                = "ELB"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_instance_lifetime            = 2592000
      + max_size                         = 10
      + metrics_granularity              = "1Minute"
      + min_elb_capacity                 = 2
      + min_size                         = 2
      + name                             = (known after apply)
      + name_prefix                      = "web"
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-06caf71c8b0afd909",
          + "subnet-0f91dd2675e7a16c3",
        ]
      + wait_for_capacity_timeout        = "20m"
      + warm_pool_size                   = (known after apply)

      + instance_maintenance_policy {
          + max_healthy_percentage = 200
          + min_healthy_percentage = 100
        }

      + instance_refresh {
          + strategy = "Rolling"
          + triggers = [
              + "tag",
            ]

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template (known after apply)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }
              + override (known after apply)
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "webserver"
        }
      + tag {
          + key                 = "account"
          + propagate_at_launch = true
          + value               = "493370826424"
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/infrahouse-website-infra"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/website-pod/aws"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "production"
        }
      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "website"
        }

      + traffic_source (known after apply)
    }

  # module.website-staging.aws_autoscaling_policy.cpu_load will be created
  + resource "aws_autoscaling_policy" "cpu_load" {
      + arn                     = (known after apply)
      + autoscaling_group_name  = (known after apply)
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = (known after apply)
      + policy_type             = "TargetTrackingScaling"

      + target_tracking_configuration {
          + disable_scale_in = false
          + target_value     = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

  # module.website-staging.aws_launch_template.website will be created
  + resource "aws_launch_template" "website" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0ea80799a59ad106b"
      + instance_type          = "t3.micro"
      + key_name               = "aleks"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web"
      + tags_all               = {
          + "created_by"  = "infrahouse/infrahouse-website-infra"
          + "environment" = "production"
        }
      + user_data              = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQvY2xvdWQtY29uZmlnDQpNaW1lLVZlcnNpb246IDEuMA0KDQojY2xvdWQtY29uZmlnCiJhcHQiOgogICJzb3VyY2VzIjoKICAgICJpbmZyYWhvdXNlIjoKICAgICAgImtleSI6IHwKICAgICAgICAtLS0tLUJFR0lOIFBHUCBQVUJMSUMgS0VZIEJMT0NLLS0tLS0KCiAgICAgICAgbVFJTkJHUzdGdGtCRUFERitZbURnNlF2c3Y1VjZaUXcrUWh4ZFR2ak1YZUxDOVQ2UkZSVkQ5NDdxS3p0Tk5RbgogICAgICAgICtBL3l4cHJMQW1XMjVVdS8xMW9Dc3pOVklJYVIzT1k4TXR5aWxiQ3R6VWtCenZXZGxYM0h2VHc5MUxwOGJ4VUwKICAgICAgICBFWE9NOW5zY3FPck92ZkJqYW5wbEtERUtQTVk2dklaM2twMXJVc0NOR0xCTDB4MktaZ1U4MHVsUnNNTThxbkJOCiAgICAgICAga3BUaUFlWEtPRVZ0UnpsV2x2T0ZMSjdwWUR2YVowVWdIU1Z1RStaa2xkcU9kTExScEtrZEl2SlBja1hxTDV4VAogICAgICAgIFV2V1RXMWVuRkFIZDUrTlF4TW5DYTNpa2pRVjNEVGxFanNnTExRYmJ5c1hqWFByNlBJUHMyOWNUY2ZvcTQzMU8KICAgICAgICB0UjREclpCNHZNRU9BODhUbUtCa0VpTUcraUI5Y2p6NXdCSXVNdTk1Wm1vSnhkdmpQUjcyRllLZ3JDWE50TmhkCiAgICAgICAgVmVyRVJ2cExUaGRhUm1aZ2k3bHkrRHZrWTdMcXlKUHZkSGNxeGVkZ0ZuUEtSNFQrZ1NRbWJVUGQ5cXFkSlIwUQogICAgICAgIEtsL1BtdHVTL3c5Z3kyWjRheTBRSUtyTkJ6UXhoQThMRFpwcDFydWZDSjUrWk1lZjkwdkhwd3hNK09hUHJ5TmwKICAgICAgICBFZERXN1lROGZ1QjVuUHFqd1VBcG1sWVlMSllsZDd2Sjc5RUl4L3NqZ2g2RytJRmltN3hSN1dpUUYvbkpldmZxCiAgICAgICAgdnpZTzdvci9HSUNiNmVad3ZQZHR5NzlIbVZlUHFFVGxEVTAwb3lvcFd5VHNZeVNZRFNIbi80ZG9UdXg4ditGLwogICAgICAgIFlleWJ2Z3FicmlIN2lTRjhIeHdFRmVEanJNdFVUSHNYQzM1REhGZU1DaEpveHN5S3Y0OEorYklHRndBUkFRQUIKICAgICAgICB0QzFKYm1aeVlVaHZkWE5sSUZCaFkydGhaMlZ5SUR4d1lXTnJZV2RsY2tCcGJtWnlZV2h2ZFhObExtTnZiVDZKCiAgICAgICAgQWxRRUV3RUtBRDRXSVFTaU5oNWtZM3c4VzBnQUY4WGd1SmFveGZjRDd3VUNaTHNXMlFJYkF3VUpBOEpuQUFVTAogICAgICAgIENRZ0hBZ1lWQ2drSUN3SUVGZ0lEQVFJZUFRSVhnQUFLQ1JEZ3VKYW94ZmNEN3diN0QvOWVuYnRPMURFUW4xUHQKICAgICAgICBoZ2t0SCtJcmJCZFlSSGs3MWlsMmhibm1BYm9Ma2sxYWsvYWFRWS9YUURKRmhyQTdqTWtQTE9DUmVvdEhpUW12CiAgICAgICAgMVVmcURjTTJlUTQveDBOOUYyRExVU2t1d3cxMTd2dHRVb0J4aXJCNzJwTzBUL2xkOW8zOVNITUMvRGZrNnk2aAogICAgICAgIHRUR3F4TGdoOGozRFN5TzVFRXJKTGEvM0J2TXFyNGlxYjNQVHdOZURSRWphdlFKaFhTdkVGanlBQ29vOWQ3cnMKICAgICAgICA3bGhDYmJTUGpnVGNHL1BDZnpMcjM3UXl6WGlUUi9Ud2ppd1ZkVGhkQ1MvQ0tuc29NOG5nSHhqWFlwSzdNNndnCiAgICAgICAgdHpBOEprSFpyNU1wa3JQR3JnUWV2aEpCTGtIUi9qY3NhYUJaTjdudzhhZUhjd3dNNC9DaEhJeVpkUTkxMDU5cAogICAgICAgIE9NYVltV21qUFFmcTFyT25BQXZBMXhXdytUWk56SGdXSXE0dnVzeDdPQnZyRnNWZVpOc3FkN09hNHBydFZXZzAKICAgICAgICA5MWNLWkpvL092Nm9wTS93RFdOMnlCbmttQkN3YVhwb0g1TkRRMjJiaG5HVEplSVdkZWk4VVNHcHZCa1R4QkkyCiAgICAgICAgWDMycHlPbVpEbjgxTDJ6TTJpb052Z1hJYjV1NXRqYjlOT2lBdDZvVzBHMHgwMGRncjNyNnB1OHFtTXdrQlZCQwogICAgICAgIHZXd0VtYXhRbmtUaG5iQWQ1N1ZiYXQ0Ly91RGNIRnBEYUJQcEZXZUNMMmRmRFNyUzlpaUs2SzFWa3ZHTG9YaDgKICAgICAgICBNcEpxam9kZHBmTmg0dXlmekt5TkUxZHJRMjltY3dmSWx6WG9QcmIwOVc2WkhwbSt0cWQ4TWs3MDd6d3NkRkdSCiAgICAgICAgcVJzeG10UG45SjFyZVlaaVZ1RTVHMjZmMWFLVFI3a0NEUVJrdXhiWkFSQUE0KzlrbjRzbUJYWmNNMHZGcTlSOAogICAgICAgIDI0WEtadFRhVm1Wb1ZKTVJRTTQ0cVdSK3MvUzBNenZiTzV1MGNTVlRoWTY1WXpNTHM5MjBVWTZ1R3BvUzJaWXcKICAgICAgICBJTWlwa2FCKzJGNkI4UjdWN25sL1NnYVhHYTJNZXhrQzd3dDZibEZiYXc3cGJ2SStpSTl3UzhCS0hnTUR6ZDBGCiAgICAgICAgVGpTcTl2ZGtWa2Y3eUkzaEV3bGxYN3pUNklMT3Zrbk5HYm9zMGRGSTkyY0JXUXMraVhQNTB4RFZpdDMrOW1DRAogICAgICAgIHJ1V1ZZazczbXZTRXpGY3VYQ3liS0o1VS9uelNRNzBKb1FtU1BjNTBSUWp1SEdkemwvWXpHRmFGbjV6SVo1cFAKICAgICAgICBrNVMrS1RZZWt6Y2lSa0h6YmVhNVBqK0E2S1ppbEtqNXlrQVJGencrQ1B4cXN1ZWpEa2k3QSthM20zV0dxK21tCiAgICAgICAgQWtsUTRZQmNvbHpOT3BnV2NsSVN1RTNkNWtndGFKQUNJZ3RlODdGNlFCQnNrOG9EQkZRQ25abW9PaXJsU2xiZgogICAgICAgIEp1RDZmVkNKdTJ6WTdUaE4xTzBvV1R3QWFOQXZNNTVDTFR2NnMzRm10UjkybG5sUURGdUorZmo4NjNjNnF4MTQKICAgICAgICBGdU80bU03ZXVTMDh3R2dWR205MXdBN2JZbDRhaHhDNlMyQkdCNUZ2a1pmekJCd2pzZm1VV0hBdTdWUlpKeGtYCiAgICAgICAgSnA2OTZPVGRSM1JmSTdJWjZPVzZ0R0VMaWpzd1diYlpYYjVYUldFVzk5dldPN05JSzZzT3ZoTUROcDliU011YgogICAgICAgIFhQM1BiUHhneVQwYm1zczB5d05Zd3VjbmZjbURYcVBWdTNHZHQ1M2F0MStoSzdtbG5RM3VVczVlVkVPSUhuSm0KICAgICAgICBmMXRyRGdnU1RFN2Zua3g2Q3psK2lNa0FFUUVBQVlrQ1BBUVlBUW9BSmhZaEJLSTJIbVJqZkR4YlNBQVh4ZUM0CiAgICAgICAgbHFqRjl3UHZCUUprdXhiWkFoc01CUWtEd21jQUFBb0pFT0M0bHFqRjl3UHY4U1FQL2pzUWZKQ1VIcmpwWDRmUAogICAgICAgIDBOdFZ5cWxDcnExT21MUDdCTHJYckN4b0FGUmI2NFlKVWRXazVQMzVrOXdqMkJRanBqY05qMmlrODBGb28wMkUKICAgICAgICB5YytQelcvNHR6VnZkeFJyRXpzT0ZtK21NUitsbFVIQUt6QmE2UUJ4SFQwb2ZMN3A1WFlUdU1ObllvK1BqVk1tCiAgICAgICAgalAzVEVKR1lYWW11aEdmYWFKWnBqTG1KRnFwNTl4Ly9kc01IZUxxVUNod2I2Q2c2RHVrQWloZUFzM1ArclhvMwogICAgICAgIHRCbkE0SkNDaVhSNy8vMFdlelJvU1BkYWxOZW00dnM4UFQ4N3NuSGJEbGlGTVZmOHcrZmtzSW5xdm90aVJESTQKICAgICAgICBRQnJCZnMzTmRlWlcvdG11cE9hWkpSekhEdnZLYmcvL082aXAxYVB2SUxXdlRETThLY1FDUUVTYVdrQ2JJMXVjCiAgICAgICAgcml6QU1ibFRCMmd5dzl5b2pDcFZDTUJYZGl6QXFxeWw1WlZydzQrWC9pMDlJc050OGhBOS81Ulk3djNjN1oyQwogICAgICAgIFh5MnhLV210TEk5bmxPU1N3VXhCNTY2STI5bFZLQkxVbVhtUWZuUklJSENpSkRYWUZEUC82TGZ2OSttaEVXVTgKICAgICAgICBxZWQzeGhwZU5TQUl6QStNVGxqdGlSbW9yeHBkZGlYYnRDYWZjUGwvSjNYMEIwN2ZjY0pad1pzQ1lDcHRMeTFjCiAgICAgICAgeXZWYU4rRUJtam9DcDNqdDZ3TGU0eGNscVUzQUN3ei84VEREbXRKN1VVZGw3TWRraXBRWjI3OEwya3BsNm82MQogICAgICAgIE1GMmZYRDdmWk1lWmZFdzZsdTBCRjVtWjAvY2gzSHhYZVpvWGlmNzlnMjV2Wm1TZFc5N3BjZWV3UGx2bEVURlEKICAgICAgICA1NXBNb3JReVVURVFDUTNFQ3pIWVNuTC9UbVc3CiAgICAgICAgPSswUmMKICAgICAgICAtLS0tLUVORCBQR1AgUFVCTElDIEtFWSBCTE9DSy0tLS0tCiAgICAgICJzb3VyY2UiOiAiZGViIFtzaWduZWQtYnk9JEtFWV9GSUxFXSBodHRwczovL3JlbGVhc2UtamFtbXkuaW5mcmFob3VzZS5jb20vICRSRUxFQVNFCiAgICAgICAgbWFpbiIKInBhY2thZ2VfdXBkYXRlIjogdHJ1ZQoicGFja2FnZXMiOgotICJtYWtlIgotICJnY2MiCi0gInB1cHBldC1jb2RlIgotICJpbmZyYWhvdXNlLXRvb2xraXQiCi0gImluZnJhaG91c2UtcHVwcGV0LWRhdGEiCiJwdXBwZXQiOgogICJjb2xsZWN0aW9uIjogInB1cHBldDgiCiAgImluc3RhbGwiOiB0cnVlCiAgImluc3RhbGxfdHlwZSI6ICJhaW8iCiAgInBhY2thZ2VfbmFtZSI6ICJwdXBwZXQtYWdlbnQiCiAgInN0YXJ0X3NlcnZpY2UiOiBmYWxzZQoicnVuY21kIjoKLSAiL29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW4vZ2VtIGluc3RhbGwganNvbiIKLSAiL29wdC9wdXBwZXRsYWJzL3B1cHBldC9iaW4vZ2VtIGluc3RhbGwgYXdzLXNkay1jb3JlIgotICIvb3B0L3B1cHBldGxhYnMvcHVwcGV0L2Jpbi9nZW0gaW5zdGFsbCBhd3Mtc2RrLXNlY3JldHNtYW5hZ2VyIgotICJpaC1wdXBwZXQgIC0tZW52aXJvbm1lbnQgZGV2ZWxvcG1lbnQgLS1lbnZpcm9ubWVudHBhdGgge3Jvb3RfZGlyZWN0b3J5fS9lbnZpcm9ubWVudHMKICAtLXJvb3QtZGlyZWN0b3J5IC9vcHQvcHVwcGV0LWNvZGUgLS1oaWVyYS1jb25maWcgL29wdC9pbmZyYWhvdXNlLXB1cHBldC1kYXRhL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9oaWVyYS55YW1sCiAgLS1tb2R1bGUtcGF0aCB7cm9vdF9kaXJlY3Rvcnl9L21vZHVsZXMgYXBwbHkgL29wdC9wdXBwZXQtY29kZS9lbnZpcm9ubWVudHMvZGV2ZWxvcG1lbnQvbWFuaWZlc3RzL3NpdGUucHAiCiJ3cml0ZV9maWxlcyI6Ci0gImNvbnRlbnQiOiAiZXhwb3J0IEFXU19ERUZBVUxUX1JFR0lPTj11cy13ZXN0LTEiCiAgInBhdGgiOiAiL2V0Yy9wcm9maWxlLmQvYXdzLnNoIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogfC0KICAgIFtkZWZhdWx0XQogICAgcmVnaW9uPXVzLXdlc3QtMQogICJwYXRoIjogIi9yb290Ly5hd3MvY29uZmlnIgogICJwZXJtaXNzaW9ucyI6ICIwNjAwIgotICJjb250ZW50IjogfAogICAgInB1cHBldF9lbnZpcm9ubWVudCI6ICJkZXZlbG9wbWVudCIKICAgICJwdXBwZXRfcm9sZSI6ICJ3ZWJzZXJ2ZXIiCiAgInBhdGgiOiAiL2V0Yy9wdXBwZXRsYWJzL2ZhY3Rlci9mYWN0cy5kL3B1cHBldC55YW1sIgogICJwZXJtaXNzaW9ucyI6ICIwNjQ0IgotICJjb250ZW50IjogIntcImloLXB1cHBldFwiOntcImNhbmNlbF9pbnN0YW5jZV9yZWZyZXNoX29uX2Vycm9yXCI6ZmFsc2UsXCJkZWJ1Z1wiOmZhbHNlLFwiZW52aXJvbm1lbnRwYXRoXCI6XCJ7cm9vdF9kaXJlY3Rvcnl9L2Vudmlyb25tZW50c1wiLFwiaGllcmEtY29uZmlnXCI6XCIvb3B0L2luZnJhaG91c2UtcHVwcGV0LWRhdGEvZW52aXJvbm1lbnRzL2RldmVsb3BtZW50L2hpZXJhLnlhbWxcIixcIm1hbmlmZXN0XCI6XCIvb3B0L3B1cHBldC1jb2RlL2Vudmlyb25tZW50cy9kZXZlbG9wbWVudC9tYW5pZmVzdHMvc2l0ZS5wcFwiLFwibW9kdWxlLXBhdGhcIjpcIntyb290X2RpcmVjdG9yeX0vbW9kdWxlc1wiLFwicm9vdC1kaXJlY3RvcnlcIjpcIi9vcHQvcHVwcGV0LWNvZGVcIn19IgogICJwYXRoIjogIi9ldGMvcHVwcGV0bGFicy9mYWN0ZXIvZmFjdHMuZC9paC1wdXBwZXQuanNvbiIKICAicGVybWlzc2lvbnMiOiAiMDY0NCIKLSAiY29udGVudCI6ICJ7fSIKICAicGF0aCI6ICIvZXRjL3B1cHBldGxhYnMvZmFjdGVyL2ZhY3RzLmQvY3VzdG9tLmpzb24iCiAgInBlcm1pc3Npb25zIjogIjA2NDQiCg0KLS1NSU1FQk9VTkRBUlktLQ0K"
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 30
              + volume_type           = (known after apply)
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/infrahouse-website-infra"
              + "created_by_module" = "infrahouse/website-pod/aws"
              + "environment"       = "development"
              + "service"           = "website"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "account"           = "493370826424"
              + "created_by"        = "infrahouse/infrahouse-website-infra"
              + "created_by_module" = "infrahouse/website-pod/aws"
              + "environment"       = "development"
              + "service"           = "website"
            }
        }
    }

  # module.website-staging.aws_lb_listener.ssl will be created
  + resource "aws_lb_listener" "ssl" {
      + arn                      = (known after apply)
      + certificate_arn          = (known after apply)
      + id                       = (known after apply)
      + load_balancer_arn        = (known after apply)
      + port                     = 443
      + protocol                 = "HTTPS"
      + ssl_policy               = (known after apply)
      + tags                     = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all                 = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tcp_idle_timeout_seconds = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "The server cannot or will not process the request due to an apparent client error (e.g., malformed request syntax, size too large, invalid request message framing, or deceptive request routing)."
              + status_code  = "400"
            }
        }

      + mutual_authentication (known after apply)
    }

  # module.website-staging.aws_route53_record.cert_validation["staging.infrahouse.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z07662251LH3YRF2ERM3G"
    }

  # module.website-staging.aws_route53_record.extra[0] will be created
  + resource "aws_route53_record" "extra" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.infrahouse.com"
      + type            = "A"
      + zone_id         = "Z07662251LH3YRF2ERM3G"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.website-staging.aws_s3_bucket.access_log[0] will be created
  + resource "aws_s3_bucket" "access_log" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "web-access-log-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all                    = {
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.website-staging.aws_s3_bucket_policy.access_logs[0] will be created
  + resource "aws_s3_bucket_policy" "access_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.website-staging.aws_s3_bucket_public_access_block.public_access[0] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.website-staging.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Load balancer security group for service website"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "website load balancer"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all               = {
          + "Name"              = "website load balancer"
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.website-staging.aws_security_group.backend will be created
  + resource "aws_security_group" "backend" {
      + arn                    = (known after apply)
      + description            = "Backend security group for service website"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "website backend"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all               = {
          + "Name"              = "website backend"
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + vpc_id                 = "vpc-08e19d859c26d18b2"
    }

  # module.website-staging.aws_vpc_security_group_egress_rule.alb_outgoing will be created
  + resource "aws_vpc_security_group_egress_rule" "alb_outgoing" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all               = {
          + "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
    }

  # module.website-staging.aws_vpc_security_group_egress_rule.backend_outgoing will be created
  + resource "aws_vpc_security_group_egress_rule" "backend_outgoing" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all               = {
          + "Name"              = "outgoing traffic"
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
    }

  # module.website-staging.aws_vpc_security_group_ingress_rule.alb_icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all               = {
          + "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + to_port                = -1
    }

  # module.website-staging.aws_vpc_security_group_ingress_rule.alb_listener_port will be created
  + resource "aws_vpc_security_group_ingress_rule" "alb_listener_port" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "User traffic to port 80"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "user traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all               = {
          + "Name"              = "user traffic"
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + to_port                = 80
    }

  # module.website-staging.aws_vpc_security_group_ingress_rule.backend_icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all               = {
          + "Name"              = "ICMP traffic"
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + to_port                = -1
    }

  # module.website-staging.aws_vpc_security_group_ingress_rule.backend_ssh_local will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_ssh_local" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "SSH access from the service website VPC"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "SSH local"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all               = {
          + "Name"              = "SSH local"
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + to_port                = 22
    }

  # module.website-staging.aws_vpc_security_group_ingress_rule.backend_user_traffic will be created
  + resource "aws_vpc_security_group_ingress_rule" "backend_user_traffic" {
      + arn                          = (known after apply)
      + description                  = "Any traffic from the Load Balancer"
      + id                           = (known after apply)
      + ip_protocol                  = "-1"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "Name"              = "Load balancer traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all                     = {
          + "Name"              = "Load balancer traffic"
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
    }

  # module.website-staging.aws_vpc_security_group_ingress_rule.https will be created
  + resource "aws_vpc_security_group_ingress_rule" "https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "User traffic to HTTPS port"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "https user traffic"
          + "account"           = "493370826424"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + tags_all               = {
          + "Name"              = "https user traffic"
          + "account"           = "493370826424"
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/website-pod/aws"
          + "environment"       = "development"
          + "service"           = "website"
        }
      + to_port                = 443
    }

  # module.website-staging.random_string.profile_suffix will be created
  + resource "random_string" "profile_suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.website-staging.module.instance_profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id   = (known after apply)
    }

  # module.website-staging.module.instance_profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ec2:Describe*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
    }

  # module.website-staging.module.instance_profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/infrahouse-website-infra"
          + "created_by_module" = "infrahouse/instance-profile/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.website-staging.module.instance_profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

Plan: 30 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2Utd2Vic2l0ZS1pbmZyYS90ZXJyYWZvcm0udGZzdGF0ZSI6IHsic3VjY2VzcyI6IHRydWUsICJhZGQiOiAzMCwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19
```
</details>